#Область СлужебныеПроцедурыИФункции

	Процедура ДополнитьФорму(Форма) Экспорт
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" 
		Или ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента"
		Или ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда  
		
		ПолеКонтактныеЛица = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
		ПолеКонтактныеЛица.Вид = ВидПоляФормы.ПолеВвода;
		ПолеКонтактныеЛица.ПутьКДанным = "Объект.КонтактныеЛица";
	КонецЕсли;	
	
	Если ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" 
		Или ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда  
		
		ПолеКонтактныеЛица = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.СуммаДокумента);
		ПолеКонтактныеЛица.Вид = ВидПоляФормы.ПолеВвода;
		ПолеКонтактныеЛица.ПутьКДанным = "Объект.КонтактныеЛица";
	КонецЕсли;
	
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		
		ГруппаСкидки = Форма.Элементы.Добавить("ГруппаСкидки", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
		ГруппаСкидки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСкидки.ОтображатьЗаголовок = Ложь;
    	ГруппаСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
		ГруппаСкидки.Заголовок = "Группа скидки";
       	
		ПолеСкидка = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидки);
		ПолеСкидка.Вид = ВидПоляФормы.ПолеВвода;
		ПолеСкидка.ПутьКДанным = "Объект.СогласованнаяСкидка"; 
		Форма.Элементы.СогласованнаяСкидка.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
		
		КомандаПересчитатьТаблицу = Форма.Команды.Добавить("ПересчитатьТаблицу");
		КомандаПересчитатьТаблицу.Заголовок = "Пересчитать таблицу";
		КомандаПересчитатьТаблицу.Действие = "ТХ_ПересчитатьТаблицу";
		
		КнопкаКоманды = Форма.Элементы.Добавить("ПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидки);
		КнопкаКоманды.ИмяКоманды = "ПересчитатьТаблицу"; 
			
	КонецЕсли;
		
КонецПроцедуры   

#КонецОбласти
