# Область СлужебныеПроцедурыИФункции
	
Процедура ПересчитатьТаблицу(Источник) Экспорт 
	
	ПересчетТаблицыТоварыИУслуги(Источник); 
	
КонецПроцедуры

Процедура СогласованнаяСкидкаПриИзменении(Источник) Экспорт
	Если Источник.Товары.Количество() = 0 И Источник.Услуги.Количество() = 0 Тогда
		Возврат;
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект, Источник);
		ПоказатьВопрос(Оповещение, "Пересчитать суммы в таблице товаров и услуг?", РежимДиалогаВопрос.ДаНет); 
	КонецЕсли;	
КонецПроцедуры 


Процедура ПослеОтветаНаВопрос(Результат, Источник) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат; 
	Иначе
		ПересчетТаблицыТоварыИУслуги(Источник);
	КонецЕсли;	
КонецПроцедуры

Процедура ПересчетТаблицыТоварыИУслуги(Источник)
	Для Каждого Строка Из Источник.Товары Цикл 
		СуммаСкидки = Строка.Цена * Строка.Количество * Источник.ТХ_СогласованнаяСкидка / 100;
		Строка.Сумма = Строка.Цена * Строка.Количество - СуммаСкидки;
	КонецЦикла; 	
	
	Для Каждого Строка Из Источник.Услуги Цикл 
		СуммаСкидки = Строка.Цена * Строка.Количество * Источник.ТХ_СогласованнаяСкидка / 100;
		Строка.Сумма = Строка.Цена * Строка.Количество - СуммаСкидки;
	КонецЦикла;  	
КонецПроцедуры

#КонецОбласти
